

namespace WpfHangulKeyBoard
{
    // 초성: ㄱㄲㄴㄷㄸㄹㅁㅂㅃㅅㅆㅇㅈㅉㅊㅋㅌㅍㅎ (19개)
    public enum FirstLetter : uint
    {
        ㄱ = 0x1100,     // ㄱ
        ㄲ = 0x1101,    // ㄲ
        ㄴ = 0x1102,     // ㄴ
        ㄷ = 0x1103,     // ㄷ
        ㄸ = 0x1104,    // ㄸ
        ㄹ = 0x1105,     // ㄹ
        ㅁ = 0x1106,     // ㅁ
        ㅂ = 0x1107,     // ㅂ
        ㅃ = 0x1108,    // ㅃ
        ㅅ = 0x1109,     // ㅅ
        ㅆ = 0x110A,    // ㅆ
        ㅇ = 0x110B,    // ㅇ (없음)
        ㅈ = 0x110C,     // ㅈ
        ㅉ = 0x110D,    // ㅉ
        ㅊ = 0x110E,     // ㅊ
        ㅋ = 0x110F,     // ㅋ
        ㅌ = 0x1110,     // ㅌ
        ㅍ = 0x1111,     // ㅍ
        ㅎ = 0x1112,      // ㅎ
        ㅏ = 0x1161,      // ㅏ
        ㅐ = 0x1162,     // ㅐ
        ㅑ = 0x1163,     // ㅑ
        ㅒ = 0x1164,    // ㅒ
        ㅓ = 0x1165,     // ㅓ
        ㅔ = 0x1166,      // ㅔ
        ㅕ = 0x1167,    // ㅕ
        ㅖ = 0x1168,     // ㅖ
        ㅗ = 0x1169,      // ㅗ
        ㅘ = 0x116A,     // ㅘ
        ㅙ = 0x116B,    // ㅙ
        ㅚ = 0x116C,     // ㅚ
        ㅛ = 0x116D,     // ㅛ
        ㅜ = 0x116E,      // ㅜ
        ㅝ = 0x116F,    // ㅝ
        ㅞ = 0x1170,     // ㅞ
        ㅟ = 0x1171,     // ㅟ
        ㅠ = 0x1172,     // ㅠ
        ㅡ = 0x1173,     // ㅡ
        ㅢ = 0x1174,     // ㅢ
        ㅣ = 0x1175,       // ㅣ
        ㄳ = 0x11AA,     // ㄳ
        ㄵ = 0x11AC,     // ㄵ
        ㄶ = 0x11AD,     // ㄶ
        ㄺ = 0x11B0,     // ㄺ
        ㄻ = 0x11B1,     // ㄻ
        ㄼ = 0x11B2,     // ㄼ
        ㄽ = 0x11B3,     // ㄽ
        ㄾ = 0x11B4,     // ㄾ
        ㄿ = 0x11B5,     // ㄿ
        ㅀ = 0x11B6,     // ㅀ
        ㅄ = 0x11B9,     // ㅄ
    }

    // 중성: ㅏㅐㅑㅒㅓㅔㅕㅖㅗㅘㅙㅚㅛㅜㅝㅞㅟㅠㅡㅢㅣ (21개)
    public enum MiddleLetter : uint
    {
        ㅏ = 0x1161,      // ㅏ
        ㅐ = 0x1162,     // ㅐ
        ㅑ = 0x1163,     // ㅑ
        ㅒ = 0x1164,    // ㅒ
        ㅓ = 0x1165,     // ㅓ
        ㅔ = 0x1166,      // ㅔ
        ㅕ = 0x1167,    // ㅕ
        ㅖ = 0x1168,     // ㅖ
        ㅗ = 0x1169,      // ㅗ
        ㅘ = 0x116A,     // ㅘ
        ㅙ = 0x116B,    // ㅙ
        ㅚ = 0x116C,     // ㅚ
        ㅛ = 0x116D,     // ㅛ
        ㅜ = 0x116E,      // ㅜ
        ㅝ = 0x116F,    // ㅝ
        ㅞ = 0x1170,     // ㅞ
        ㅟ = 0x1171,     // ㅟ
        ㅠ = 0x1172,     // ㅠ
        ㅡ = 0x1173,     // ㅡ
        ㅢ = 0x1174,     // ㅢ
        ㅣ = 0x1175,       // ㅣ

    }

    // 종성 : ㄱㄲㄳㄴㄵㄶㄷㄹㄺㄻㄼㄽㄾㄿㅀㅁㅂㅄㅅㅆㅇㅈㅊㅋㅌㅍㅎ (27개 + 공백 = 28개)
    public enum LastLetter : uint
    {
        ㄱ = 0x11A8,      // ㄱ, 
        ㄲ = 0x11A9,     // ㄲ
        ㄳ = 0x11AA,     // ㄳ
        ㄴ = 0x11AB,      // ㄴ
        ㄵ = 0x11AC,     // ㄵ
        ㄶ = 0x11AD,     // ㄶ
        ㄷ = 0x11AE,      // ㄷ
        ㄹ = 0x11AF,      // ㄹ
        ㄺ = 0x11B0,     // ㄺ
        ㄻ = 0x11B1,     // ㄻ
        ㄼ = 0x11B2,     // ㄼ
        ㄽ = 0x11B3,     // ㄽ
        ㄾ = 0x11B4,     // ㄾ
        ㄿ = 0x11B5,     // ㄿ
        ㅀ = 0x11B6,     // ㅀ
        ㅁ = 0x11B7,      // ㅁ
        ㅂ = 0x11B8,      // ㅂ
        ㅄ = 0x11B9,     // ㅄ
        ㅅ = 0x11BA,      // ㅅ
        ㅆ = 0x11BB,     // ㅆ
        ㅇ = 0x11BC,     // ㅇ
        ㅈ = 0x11BD,      // ㅈ
        ㅊ = 0x11BE,      // ㅊ
        ㅋ = 0x11BF,      // ㅋ
        ㅌ = 0x11C0,      // ㅌ
        ㅍ = 0x11C1,      // ㅍ
        ㅎ = 0x11C2,       // ㅎ
        space = 0x0         // NULL
    }

    // 한글 음절 목록
    // 표현할 수 있는 모든 글자 수 : 11,172
    // 19 * 21 * (27 + 1) = 11_172
    // 한글 조합형 인코딩에서는 모두 표현 가능
    // KS X 1001 한글 완성형 인코딩에는 자주 사용하는 2_350 글자만 포함
    // 나머지 8_822 글자는 표현할 수 없음으로 고유 명사 표기할 때 문제가 발생
    // 최근 확장 완성형 코드나 유니 코드 계열에서는 11_172 글자를 모두 지원함
    // (범위)
    // 1100 ~ 11FF (256)     한글 자모
    // 3130 ~ 318F (96)      호환용 한글 자모
    // AC00 ~D7AF(11184)   한글 음절

    public class HangulSyllable { }
}


//초성 - first consonant letter
//중성 - middle vowel letter
//종성 - last consonant letter